Catalogs/РабочиеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>РабочиеЦентры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Рестораны</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РабочиеЦентры/Forms/ФормаНастройкиДоступа/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	Перем Отказ;
	
	ОчиститьСообщения();
	
	УстановитьПравилаИспользования(ВладелецПравДоступа, ПравилаИспользования, Отказ);

	Если Не Отказ Тогда
		Закрыть(Истина);
	КонецЕсли; 
	
КонецПроцедуры // ОК()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецПравДоступа = Параметры.ВладелецПравДоступа;
	
	ПолучитьПравилаИспользования(ВладелецПравДоступа, ПравилаИспользования);
	
КонецПроцедуры // ПриСозданииНаСервере()


&НаСервереБезКонтекста
Процедура ПолучитьПравилаИспользования(Ссылка, Объект)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РабочиеЦентры.Ссылка КАК ОбъектДоступа,
	                      |	РабочиеЦентры.Представление КАК Представление,
	                      |	ЕСТЬNULL(НастройкиПравДоступаПользователей.Актуальность, ИСТИНА) КАК Актуальность,
	                      |	ВЫБОР
	                      |		КОГДА РабочиеЦентры.ПометкаУдаления
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК ИндексКартинки,
	                      |	ЛОЖЬ КАК ТолькоПросмотр,
	                      |	ИСТИНА КАК Доступность
	                      |ИЗ
	                      |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	                      |		ПО (НастройкиПравДоступаПользователей.ОбъектДоступа = РабочиеЦентры.Ссылка)
	                      |			И (НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ВладелецПравДоступа)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РабочиеЦентры.Владелец.Наименование,
	                      |	РабочиеЦентры.Наименование
	                      |ИТОГИ
	                      |	РабочиеЦентры.Владелец КАК ОбъектДоступа,
	                      |	ПРЕДСТАВЛЕНИЕССЫЛКИ(РабочиеЦентры.Владелец) КАК Представление,
	                      |	4 КАК ИндексКартинки,
	                      |	ИСТИНА КАК ТолькоПросмотр,
	                      |	ИСТИНА КАК Доступность
	                      |ПО
	                      |	РабочиеЦентры.Владелец КАК ОбъектДоступа
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ВладелецПравДоступа", Ссылка);
	
	ПравилаИспользования = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВДанныеФормы(ПравилаИспользования, Объект);	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПолучитьПравилаИспользования()

&НаСервереБезКонтекста
Процедура УстановитьПравилаИспользования(Ссылка, Знач Объект, Отказ)

	Отказ = Ложь;

	УстановитьПривилегированныйРежим(Истина);
	
	ПравилаИспользования = ДанныеФормыВЗначение(Объект, Тип("ДеревоЗначений"));
	
	НаборЗаписей = РегистрыСведений.НастройкиПравДоступаПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВладелецПравДоступа.Установить(Ссылка);
	
	// Актуальные.
	Для Каждого СтрокаПравилИспользования Из ПравилаИспользования.Строки.НайтиСтроки(Новый Структура("Актуальность,ТолькоПросмотр", Ложь, Ложь), Истина) Цикл 
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаПравилИспользования);
		Запись.ВладелецПравДоступа = Ссылка;
	КонецЦикла; 

	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		// TODO: Регистрация ошибки.
		__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Не удалось изменить права доступности'; uk = 'Не вдалося змінити права доступності'"), ,, "ПравилаИспользования", Отказ);
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УстановитьПравилаИспользования()
